package cn.faury.fdk.ftp;

import java.util.Random;

public class Test {
    @org.junit.Test
    public void tet() {
        String[] word = {"霆", "晓", "衡", "儒", "翰", "蔚", "忆", "双", "涛",
                "耀", "艺", "巍", "尧", "谊", "影", "润", "成",
                "翔", "隆", "东", "森", "迪", "赛", "睿", "艾", "高", "德", "雅", "格",
                "纳", "欣", "亿", "维", "锐", "菲", "佳", "沃", "晟", "捷", "乐", "飞",
                "福", "皇", "嘉", "达", "佰", "美", "元", "亮", "名", "欧", "特", "辰",
                "康", "讯", "鹏", "腾", "宏", "伟", "钧", "思", "正", "博", "扬", "索",
                "蓝", "昂", "兴", "聚", "鸿", "略", "众", "汇", "圣", "卓", "宇", "国",
                "普", "绿", "斯", "登", "诺", "恒", "辉", "缘", "旺", "融", "誉", "际",
                "骄", "为", "诚", "妙", "英", "虹", "芬", "馨", "尼", "迈", "群", "拓",
                "建", "江", "雷", "天", "策", "优", "聪", "垒", "蕾", "瀚", "骁", "永",
                "吉", "先", "君", "依", "昌", "哲", "营", "舒", "曙", "廷", "渲", "梦",
                "瑜", "菏", "凤", "叶", "卫", "易", "威", "玛", "日", "伦", "道", "发",
                "唯", "一", "才", "月", "丹", "文", "立", "玉", "平", "同", "志", "宜",
                "林", "奇", "政", "朋", "诗", "香", "鼎", "碧", "麦", "邦", "克", "凡",
                "利", "卡", "多", "安", "尚", "川", "州", "帝", "悦", "明", "滋",
                "祥", "逸", "风", "致", "春", "帅", "盈", "泓", "品", "庭", "展", "朔",
                "轩", "育", "航", "津", "启", "振", "聆", "翌", "迎", "常", "浩",
                "杰", "智", "越", "岚", "超", "清", "云", "淼", "业", "义", "意",
                "资", "湘", "会", "萌", "语", "荣", "赫", "宁", "铭", "齐", "毅",
                "进", "臻", "燕", "霖", "霏", "莲", "灿", "颜", "麒", "韬", "露", "鹤",
                "骄", "厅", "湾", "凡", "可", "巧", "弘", "禾", "竹", "多", "帆", "秀",
                "贝", "仑", "青", "笑", "宗", "雨", "虹", "纪", "亭", "俊", "禹", "垚",
                "秋", "宸", "加", "涵", "微", "金",
                "新", "中", "盛", "亚", "信", "华", "豪", "奥", "凯", "泰", "鑫", "创",
                "宝", "星", "联", "晨", "百", "尔", "海", "瑞", "科", "锦", "彩", "朗",
                "郎", "爱", "景", "帆", "阳", "驰", "通", "骏", "力", "顺", "领", "迅",
                "途", "益", "和", "园", "波", "丰", "壹", "泽", "旭", "巨"};
        int count = 50;

        do {
            int a = (new Random()).nextInt(word.length);
            int b = (new Random()).nextInt(word.length);
            int c = (new Random()).nextInt(word.length);
            System.out.println(String.format("%s%s%s", word[a], word[b], word[c]));
        } while (count-- > 0);
    }

}
